Repository: herve4m/hexkudo
Catalog: help/*/*.po
Languages: fr

# _
source: translator-credits
fr: credits-traducteur

source: Choose a puzzle and start playing.
fr: Choisissez un puzzle et commencez à jouer.

source: Basics
fr: Notions de base

source: To play <app>Hexkudo</app>, start by selecting a difficulty level and a puzzle shape. You can play <app>Hexkudo</app> with the keyboard, the mouse, or a combination of the two.
fr: Pour jouer à <app>Hexkudo</app>, commencez par sélectionner un niveau de difficulté et une forme de puzzle. Vous pouvez jouer à <app>Hexkudo</app> au clavier, à la souris ou en combinant les deux.

source: Choosing a Puzzle
fr: Choisir un puzzle

source: To start a game, the first step consists of selecting a difficulty level between Easy, Medium, and Hard.
fr: Pour démarrer une partie, la première étape consiste à choisir un niveau de difficulté parmi Facile, Moyen et Difficile.

source: The next step consists of selecting a puzzle shape. With the Random option, <app>Hexkudo</app> randomly selects a shape for you.
fr: L’étape suivante consiste à choisir une forme de puzzle. Avec l’option Aléatoire, <app>Hexkudo</app> sélectionne une forme pour vous de manière aléatoire.

source: Using the Keyboard and the Mouse
fr: Utilisation du clavier et de la souris

source: You can use the keyboard to play <app>Hexkudo</app>:
fr: Vous pouvez utiliser le clavier pour jouer à <app>Hexkudo</app> :

source: Select a cell by using the arrow or the <key>Tab</key> keys.
fr: Sélectionnez une case en utilisant les touches fléchées ou la touche <key>Tab</key>.

source: To enter a number, select the cell and type the number.
fr: Pour saisir un nombre, sélectionnez la case et tapez le nombre.

source: To remove a number, select the cell and press <key>Delete</key>.
fr: Pour supprimer un nombre, sélectionnez la case et appuyez sur <key>Delete</key>.

source: You can also use the mouse:
fr: Vous pouvez aussi utiliser la souris :

source: Select a cell by clicking it with the mouse.
fr: Sélectionnez une case en cliquant dessus avec la souris.

source: Click the number to add to the cell. Numbers that you already entered are displayed in blue in the number picker.
fr: Cliquez sur le chiffre à ajouter à la case. Les chiffres que vous avez déjà saisis sont affichés en bleu dans le sélecteur de nombres.

source: Selecting a number
fr: Sélection d’un nombre

source: To remove a number, click the cell and click <gui style="button">Clear</gui>.
fr: Pour supprimer un nombre, cliquez sur la case puis sur <gui style="button">Effacer</gui>.

source: You can also draw the path with the mouse:
fr: Vous pouvez également tracer le chemin avec la souris :

source: Click a cell that already has a number and hold the mouse button.
fr: Cliquez sur une case qui contient déjà un nombre et maintenez le bouton de la souris enfoncé.

source: Drag the mouse to an adjacent cell: this new cell gets the next number.
fr: Faites glisser la souris vers une case adjacente : ce nouvel hexagone reçoit le nombre suivant.

source: Continue dragging the mouse along the path to complete the puzzle.
fr: Continuez à faire glisser la souris le long du chemin pour compléter le puzzle.

source: You can perform this drag motion with the left button to draw the path in the ascending number order.
fr: Vous pouvez effectuer ce glissement avec le bouton gauche pour tracer le chemin dans l’ordre croissant des nombres.

source: Drawing the path with the left mouse button
fr: Tracer le chemin avec le bouton gauche de la souris

source: Use the right button to draw the path in the descending number order.
fr: Utilisez le bouton droit pour tracer le chemin dans l’ordre décroissant des nombres.

source: Drawing the path with the right mouse button
fr: Tracer le chemin avec le bouton droit de la souris

source: Set and undo checkpoints.
fr: Définir et annuler des points d’étape.

source: Setting Checkpoints
fr: Configurer les points d’étape

source: You can save the current state of the puzzle, and return to that known state later.
fr: Vous pouvez sauvegarder l’état actuel du puzzle et revenir à cet état connu plus tard.

source: To set a checkpoint, click the menu button (<_:media-1/>) and select <gui style="menuitem">Set Checkpoint</gui>.
fr: Pour définir un point d’étape, cliquez sur le bouton de menu (<_:media-1/>) et sélectionnez <gui style="menuitem">Définir un point d’étape</gui>.

source: To go back to the state of the puzzle at the time of the checkpoint, click the menu button (<_:media-1/>), select <gui style="menuitem">Undo to Last Checkpoint</gui>, and confirm the operation.
fr: Pour revenir à l’état du puzzle au moment du point d’étape, cliquez sur le bouton de menu (<_:media-1/>), sélectionnez <gui style="menuitem">Rétablir le dernier point d’étape</gui>, puis confirmez l’opération.

source: You can take several checkpoints while solving the puzzle. The undo function reverts to the latest checkpoint, and discards this checkpoint. For example, consider that you set three checkpoints, A, B, and C, in this order:
fr: Vous pouvez définir plusieurs points d’étape pendant la résolution du puzzle. La fonction d’annulation revient au dernier point d’étape et supprime ce point d’étape. Par exemple, supposons que vous ayez défini trois points d’étape, A, B et C, dans cet ordre :

source: The first undo operation reverts to the puzzle state at the C checkpoint and discards this C checkpoint.
fr: La première opération d’annulation revient à l’état du puzzle au point d’étape C et supprime ce point C.

source: Another undo reverts to the B checkpoint and discards the B checkpoint.
fr: Une autre annulation revient au point d’étape B et supprime le point B.

source: Yet another undo reverts to the A checkpoint and discards this last checkpoint.
fr: Une nouvelle annulation revient au point d’étape A et supprime ce dernier point d’étape.

source: You can also discard all your work and start over by clicking the menu button (<_:media-1/>) and selecting <gui style="menuitem">Reset Puzzle</gui>.
fr: Vous pouvez aussi abandonner tout votre travail et recommencer en cliquant sur le bouton de menu (<_:media-1/>) et en sélectionnant <gui style="menuitem">Réinitialiser le puzzle</gui>.

source: Change the colors of the puzzle.
fr: Changez les couleurs du puzzle.

source: Customizing Colors
fr: Personnalisation des couleurs

source: You can adjust the color of the <app>Hexkudo</app> puzzle to your liking. Each individual component of a puzzle can have a custom color:
fr: Vous pouvez ajuster les couleurs du puzzle <app>Hexkudo</app> selon vos préférences. Chaque composant du puzzle peut avoir une couleur personnalisée :

source: The numbers in cells.
fr: Les chiffres dans les hexagones.

source: The numbers for wrong or duplicated cells.
fr: Les chiffres des hexagones incorrects ou dupliquée.

source: The background of the cells.
fr: L’arrière-plan des hexagones.

source: The background of the cells that provide hints at the beginning of the game.
fr: L’arrière-plan des hexagones qui fournissent des indices au début de la partie.

source: The background of the currently selected cell.
fr: L’arrière-plan de la case actuellement sélectionnée.

source: The borders of cells and the diamonds.
fr: Les bordures des hexagones et les losanges.

source: The path.
fr: Le chemin.

source: The puzzle background can be hidden.
fr: L’arrière-plan du puzzle peut être masqué.

source: You select a custom color for a component as follows:
fr: Pour sélectionner une couleur personnalisée pour un composant, procédez comme suit :

source: Click the menu button (<_:media-1/>).
fr: Cliquez sur le bouton de menu (<_:media-1/>).

source: Go to <gui style="menuitem">Preferences</gui> and go to the <gui style="group">Appearance</gui> section.
fr: Allez dans <gui style="menuitem">Préférences</gui> puis dans la section <gui style="group">Apparence</gui>.

source: Clear the checkbox for the component for which you want to change the color. When the checkbox is enabled, <app>Hexkudo</app> uses the default color. When the checkbox is cleared, you can select the color.
fr: Décochez la case à cocher du composant dont vous souhaitez changer la couleur. Lorsque la case est cochée, <app>Hexkudo</app> utilise la couleur par défaut. Lorsqu’elle est décochée, vous pouvez sélectionner la couleur.

source: To hide the puzzle background, clear the <gui style="button">Show the Puzzle Background</gui> checkbox.
fr: Pour masquer l’arrière-plan du puzzle, décochez la case à cocher <gui style="button">Afficher l’arrière-plan du puzzle</gui>.

source: To make the selected cell more visible, enable the <gui style="button">Use Thick Borders for the Selected Cell</gui> checkbox.
fr: Pour rendre la case sélectionnée plus visible, activez la case à cocher <gui style="button">Utiliser des bordures épaisses pour la case sélectionnée</gui>.

source: Close the <gui>Preferences</gui> dialog.
fr: Fermez la boîte de dialogue <gui>Préférences</gui>.

source: Display the number of errors.
fr: Afficher le nombre d’erreurs.

source: Showing the Mistake Counter
fr: Afficher le compteur d’erreurs

source: <app>Hexkudo</app> can display a counter that shows the number of mistakes.
fr: <app>Hexkudo</app> peut afficher un compteur indiquant le nombre d’erreurs.

source: Because you can mistakenly select the wrong cell, <app>Hexkudo</app> gives you three seconds to correct your error before recording the mistake.
fr: Puisque vous pouvez sélectionner par erreur le mauvais hexagone, <app>Hexkudo</app> vous accorde trois secondes pour corriger votre erreur avant d’enregistrer la faute.

source: You can hide or show the counter:
fr: Vous pouvez afficher ou masquer le compteur :

source: Go to <gui style="menuitem">Preferences</gui>.
fr: Allez dans <gui style="menuitem">Préférences</gui>.

source: In the <gui style="group">General</gui> section, select the <gui style="button">Show Mistake Counter</gui> checkbox.
fr: Dans la section <gui style="group">Général</gui>, cochez l’option <gui style="button">Afficher le compteur d’erreurs</gui>.

source: Highlight cells with errors.
fr: Mettre en évidence les hexagones contenant des erreurs.

source: Displaying Errors
fr: Affichage des erreurs

source: <app>Hexkudo</app> helps you identify your errors by displaying cell numbers in red. For a more challenging game, you can disable this feature:
fr: <app>Hexkudo</app> vous aide à repérer vos erreurs en affichant les numéros d’hexagone en rouge. Pour un jeu plus difficile, vous pouvez désactiver cette fonctionnalité :

source: In the <gui style="group">Warnings</gui> section, clear the <gui style="button">Highlighting Wrong Values</gui> checkbox for preventing <app>Hexkudo</app> from showing you the cells with wrong values.
fr: Dans la section <gui style="group">Alertes</gui>, décochez l’option <gui style="button">Surligne les valeurs erronées</gui> pour empêcher <app>Hexkudo</app> d’afficher les hexagones avec des valeurs erronées.

source: Clear the <gui style="button">Highlighting Duplicate Cells</gui> checkbox for preventing <app>Hexkudo</app> from showing you when several cells have the same value.
fr: Décochez l’option <gui style="button">Surligne les doublons</gui> pour empêcher <app>Hexkudo</app> d’indiquer lorsque plusieurs hexagones ont la même valeur.

source: You can temporarily switch between showing or hiding errors by using the <keyseq><key>Ctrl</key><key>E</key></keyseq> shortcut. For duplicated cells, use the <keyseq><key>Ctrl</key><key>D</key></keyseq> shortcut.
fr: Vous pouvez temporairement basculer entre l’affichage et la masquage des erreurs avec le raccourci <keyseq><key>Ctrl</key><key>E</key></keyseq>. Pour les hexagones dupliqués, utilisez le raccourci <keyseq><key>Ctrl</key><key>D</key></keyseq>.

source: Display the high score board.
fr: Afficher le tableau des meilleurs scores.

source: Viewing High Scores
fr: Consulter les meilleurs scores

source: <app>Hexkudo</app> saves the 10 best times for each puzzle. For accessing the high score boards, click the menu button (<_:media-1/>) and select <gui style="menuitem">Scores</gui>.
fr: <app>Hexkudo</app> enregistre les 10 meilleurs temps pour chaque puzzle. Pour accéder aux tableaux des meilleurs scores, cliquez sur le bouton de menu (<_:media-1/>) et sélectionnez <gui style="menuitem">Scores</gui>.

source: The menu at the top of the high score window enables you to select puzzles.
fr: Le menu en haut de la fenêtre des meilleurs scores vous permet de sélectionner les puzzles.

source: Your time is added to the score board only when the <link xref="time">timer</link> is enabled.
fr: Votre temps n’est ajouté au tableau des scores que lorsque le <link xref="time">chronomètre</link> est activé.

source: You can reset all the score boards, and loose all your scores, by going to the <gui style="menuitem">Preferences</gui> dialog and clicking <gui style="button">Reset High Score Boards</gui>.
fr: Vous pouvez réinitialiser tous les tableaux des scores et perdre tous vos résultats en ouvrant la boîte de dialogue <gui style="menuitem">Préférences</gui> et en cliquant sur <gui style="button">Réinitialise le tableau des scores</gui>.

source: Learn how to play <app>Hexkudo</app>.
fr: Apprenez à jouer à <app>Hexkudo</app>.

source: <app>Hexkudo</app> is number-placement logic game. Each puzzle gives you a grid of hexagons and a few numbers as anchor. You job is to form a path with consecutive numbers. There is only one possible path, which must go through all the cells. Consecutive numbers must be adjacent and the diamond shape between two cells is a hint: the two cells have consecutive numbers.
fr: <app>Hexkudo</app> est un jeu de logique de placement de nombres. Chaque puzzle vous donne une grille d’hexagones et quelques nombres comme repères. Votre tâche est de former un chemin avec des nombres consécutifs. Il n’existe qu’un seul chemin possible, qui doit passer par tous les hexagones. Les nombres consécutifs doivent être adjacents et le losange entre deux hexagones est un indice : les deux hexagones contiennent des nombres consécutifs.

source: Play the game on screen, or <link xref="index#print">print</link> the puzzles.
fr: Jouez sur l’écran ou <link xref="index#print">imprimez</link> les puzzles.

source: If you do not have time to finish a game, you can <link xref="save-resume">resume</link> it at any time.
fr: Si vous n’avez pas le temps de finir une partie, vous pouvez la <link xref="save-resume">reprendre</link> à tout moment.

source: Solving an <app>Hexkudo</app> puzzle
fr: Résolution d’un puzzle <app>Hexkudo</app>

source: Game Play
fr: Déroulement du jeu

source: Preferences and Customizations
fr: Préférences et personnalisations

source: Printing
fr: Impression

source: Print blank puzzles.
fr: Imprimer des puzzles vierges.

source: Printing Blank Hexkudo Puzzles
fr: Impression de puzzles Hexkudo vierges

source: You can print blank puzzles.
fr: Vous pouvez imprimer des puzzles vierges.

source: Go to <gui style="menuitem">Print</gui> and select <gui style="menuitem">Print Multiple Puzzles</gui>.
fr: Allez dans <gui style="menuitem">Imprimer</gui> et sélectionnez <gui style="menuitem">Imprimer plusieurs puzzles</gui>.

source: Set the total number of puzzles to print.
fr: Définissez le nombre total de puzzles à imprimer.

source: Set the number of puzzles to print per page.
fr: Définissez le nombre de puzzles à imprimer par page.

source: Specify whether to print the puzzle solutions as additional pages at the end.
fr: Indiquez si vous souhaitez imprimer les solutions des puzzles en pages supplémentaires à la fin.

source: Select the puzzle to print and its difficulty level.
fr: Sélectionnez le puzzle à imprimer et son niveau de difficulté.

source: Click <gui style="button">Print</gui>.
fr: Cliquez sur <gui style="button">Imprimer</gui>.

source: Print the current puzzle.
fr: Imprimer le puzzle en cours.

source: Printing Your Game
fr: Imprimer votre partie

source: You can print the <app>Hexkudo</app> puzzle that you are currently playing.
fr: Vous pouvez imprimer le puzzle <app>Hexkudo</app> que vous êtes en train de jouer.

source: Go to <gui style="menuitem">Print</gui> and select <gui style="menuitem">Print Current Puzzle</gui>.
fr: Allez dans <gui style="menuitem">Imprimer</gui> et sélectionnez <gui style="menuitem">Imprimer le puzzle en cours</gui>.

source: Select your printer.
fr: Sélectionnez votre imprimante.

source: Click <gui style="button">Print</gui>. The puzzle is printed on two pages. The first page contains the unsolved puzzle, and the second page its solution.
fr: Cliquez sur <gui style="button">Imprimer</gui>. Le puzzle est imprimé sur deux pages : la première contient le puzzle non résolu et la seconde sa solution.

source: Save and resume the current game.
fr: Enregistrer et reprendre la partie en cours.

source: Saving and Resuming
fr: Enregistrement et reprise

source: Your game is saved automatically when you close the application, and it is opened when your restart <app>Hexkudo</app>.
fr: Votre partie est enregistrée automatiquement lorsque vous fermez l’application et est réouverte lorsque vous redémarrez <app>Hexkudo</app>.

source: If you would like to stop playing that game and begin a new one, then click the menu button (<_:media-1/>), and select <gui style="menuitem">New Game</gui>.
fr: Si vous souhaitez arrêter cette partie et en commencer une nouvelle, cliquez sur le bouton de menu (<_:media-1/>) et sélectionnez <gui style="menuitem">Nouvelle partie</gui>.

source: Solve cells and puzzles.
fr: Résoudre des hexagones et des puzzles.

source: Getting Help Solving Puzzles
fr: Obtenir de l’aide pour résoudre les puzzles

source: If you get stuck, then <app>Hexkudo</app> can help you by revealing the value of a cell of your choice. And if you decide to give up, then <app>Hexkudo</app> can reveal the whole puzzle.
fr: Si vous êtes bloqué, <app>Hexkudo</app> peut vous aider en révélant la valeur d’une case de votre choix. Et si vous décidez d’abandonner, <app>Hexkudo</app> peut révéler tout le puzzle.

source: You can solve a cell:
fr: Vous pouvez résoudre une case :

source: Select the cell with the mouse or the keyboard.
fr: Sélectionnez la case avec la souris ou le clavier.

source: Click the menu button (<_:media-1/>) and select <gui style="menuitem">Solve Current Cell</gui>.
fr: Cliquez sur le bouton de menu (<_:media-1/>) et sélectionnez <gui style="menuitem">Résoudre la case sélectionnée</gui>.

source: You can also solve the whole puzzle by clicking the menu button (<_:media-1/>) and selecting <gui style="menuitem">Solve Puzzle</gui>.
fr: Vous pouvez aussi résoudre tout le puzzle en cliquant sur le bouton de menu (<_:media-1/>) et en sélectionnant <gui style="menuitem">Résoudre le puzzle</gui>.

source: When you ask <app>Hexkudo</app> to solve a cell or the puzzle, you forfeit recording you time in the high score board.
fr: Lorsque vous demandez à <app>Hexkudo</app> de résoudre une case ou le puzzle, vous renoncez à l’enregistrement de votre temps dans le tableau des meilleurs scores.

source: How long it takes you to solve puzzles.
fr: Durée nécessaire pour résoudre les puzzles.

source: Timing Your Game
fr: Chronométrer votre partie

source: <app>Hexkudo</app> can display a timer to show how long it takes you to solve the puzzle. When you complete the puzzle, <app>Hexkudo</app> adds your time to the <link xref="highscores">high score</link> board.
fr: <app>Hexkudo</app> peut afficher un chronomètre pour montrer combien de temps il vous faut pour résoudre le puzzle. Lorsque vous terminez le puzzle, <app>Hexkudo</app> ajoute votre temps au tableau des <link xref="highscores">meilleurs scores</link>.

source: You can pause and resume the game by clicking on <gui style="button">Pause</gui>, or by using the <key>P</key> keyboard shortcut.
fr: Vous pouvez mettre la partie en pause et la reprendre en cliquant sur <gui style="button">Pause</gui> ou en utilisant le raccourci clavier <key>P</key>.

source: You can also disable the timer:
fr: Vous pouvez aussi désactiver le chronomètre :

source: In the <gui style="group">General</gui> section, clear the <gui style="button">Timer and Highscores</gui> checkbox.
fr: Dans la section <gui style="group">Général</gui>, décochez l’option <gui style="button">Chronomètre et tableau des scores</gui>.
