Repository: herve4m/hexkudo
Catalog: po/*.po
Languages: fr, vi

source: Hexkudo is a number-placement logic game. Each puzzle gives you a grid of hexagons and a few numbers as anchor. Your job is to connect them into a continuous path that visits every cell exactly once, in numeric order. Hexkudo comes with a simple interface and several difficulty levels that make it fun for players of all skill level.
fr: Hexkudo est un jeu de logique qui consiste à placer des chiffres dans une grille. Chaque jeu est constitué d’une grille d’hexagones et de quelques chiffres déjà placés. Votre but est de connecter les hexagones pour former un chemin continu qui traverse chaque hexagone une seule fois et dans l’ordre numérique. Hexkudo a une interface simple et plusieurs niveaux de difficulté qui rendent le jeu plaisant pour les joueurs de tous niveaux.

source: An Hexkudo game
fr: Un jeu d’Hexkudo

source: An Hexkudo game in dark mode
fr: Un jeu d’Hexkudo en mode sombre

source: _Undo to Last Checkpoint…
fr: Rétablir le _dernier point d’étape…
