Repository: herve4m/hexkudo
Catalog: po/*.po
Languages: fr, vi

source: Logic game
fr: Jeu de logique
vi: Trò chơi logic

source: Find your path in a maze of numbers
fr: Trouver son chemin dans un labyrinthe de chiffres
vi: Tìm đường đi trong mê cung số

source: GTK;GNOME;sudoku;rikudo;puzzle;
vi: GTK;GNOME;sudoku;rikudo;puzzle;đố vui;

source: Hexkudo is a number-placement logic game. Each puzzle gives you a grid of hexagons and a few numbers as anchor. Your job is to connect them into a continuous path that visits every cell exactly once, in numeric order. Hexkudo comes with a simple interface and several difficulty levels that makes it fun for players of all skill level.
vi: Hexkudo là trò chơi logic sắp xếp số. Mỗi câu đố cho bạn một lưới lục giác và vài số cố định làm mốc. Nhiệm vụ của bạn là nối chúng thành một đường đi liên tục, đi qua mỗi ô đúng một lần, theo thứ tự tăng dần. Hexkudo có giao diện đơn giản và nhiều cấp độ khó, phù hợp với mọi trình độ người chơi.

source: Features:
fr: Fonctionnalités :
vi: Tính năng:

source: Automatically save and restore your session.
fr: Sauve et restore votre jeu automatiquement.
vi: Tự động lưu và khôi phục phiên chơi.

source: Generate random puzzles.
fr: Génère des puzzles aléatoirement.
vi: Tạo câu đố ngẫu nhiên.

source: Use the mouse or the keyboard to complete the puzzles.
fr: Fonctionne avec la souris ou le clavier.
vi: Dùng chuột hoặc bàn phím để giải đố.

source: Get help with the built-in warnings.
fr: Système d’avertissements en cas d’erreurs.
vi: Nhận trợ giúp qua cảnh báo tích hợp.

source: Keep track of your progression with highscores, number of mistakes, and a timer.
fr: Gère vos progrés avec un tableau des scores, le nombre d’erreurs, et un chronomètre.
vi: Theo dõi tiến độ bằng bảng điểm cao, số lỗi và đồng hồ bấm giờ.

source: Customize the colors.
fr: Personnalisation des couleurs.
vi: Tùy chỉnh màu sắc.

source: Print puzzles to play Hexkudo on the go.
fr: Impression de puzzles pour jouer dans les transports.
vi: In câu đố để chơi mọi lúc mọi nơi.

source: Puzzle difficulty
fr: Difficulté
vi: Độ khó câu đố

source: Difficulty level of the puzzle to resolve.
fr: Niveau de difficulté du puzzle à résoudre.
vi: Cấp độ khó của câu đố cần giải.

source: Puzzle name
fr: Nom du puzzle
vi: Tên câu đố

source: Name of the puzzle.
fr: Nom du puzzle.
vi: Tên của câu đố.

source: Zoom level
fr: Niveau de zoom
vi: Mức phóng to

source: Size of the numbers in the puzzle cells.
fr: Taille des nombres dans les cases.
vi: Kích thước số trong các ô câu đố.

source: Difficulty of the puzzles to print
fr: Difficulté des puzzles à imprimer
vi: Độ khó câu đố để in

source: Difficulty level of the puzzles to print.
fr: Niveau de difficulté des puzzles à imprimer.
vi: Cấp độ khó của các câu đố để in.

source: Name of the puzzles to print
fr: Nom du puzzle à imprimer
vi: Tên câu đố để in

source: Name of the puzzle you want to print.
fr: Nom du puzzle que vous voulez imprimer.
vi: Tên câu đố bạn muốn in.

source: Print puzzle solution
fr: Imprime la solution du puzzle
vi: In kèm lời giải

source: Whether to print the puzzle solution as well.
fr: Imprimer également ou non la solution du puzzle.
vi: Có in kèm lời giải của câu đố hay không.

source: Number of puzzles to print
fr: Nombre de puzzles à imprimer
vi: Số lượng câu đố để in

source: Total number of puzzles you want to print.
fr: Nombre total de puzzles que vous voulez imprimer.
vi: Tổng số câu đố bạn muốn in.

source: Number of puzzles to print per page
fr: Nombre de puzzles à imprimer par page
vi: Số câu đố in mỗi trang

source: Number of puzzles you want to print per page.
fr: Nombre de puzzles que vous voulez imprimer sur chaque page.
vi: Số câu đố bạn muốn in trên mỗi trang.

source: Width of the window in pixels
fr: Largeur de la fenêtre en pixels
vi: Chiều rộng cửa sổ (pixel)

source: Height of the window in pixels
fr: Hauteur de la fenêtre en pixels
vi: Chiều cao cửa sổ (pixel)

source: true if the window is maximized
fr: Vrai si la fenêtre a la taille maximale
vi: true nếu cửa sổ đang phóng to

source: true if the window is fullscreen
fr: Vrai si la fenêtre est en mode plein écran
vi: true nếu cửa sổ đang toàn màn hình

source: Show the error counter
fr: Affiche le compteur d’erreurs
vi: Hiển thị bộ đếm lỗi

source: Show the number of errors during solving the puzzle.
fr: Afficher le compteur d’erreurs pendant la résolution du puzzle.
vi: Hiển thị số lần nhập sai khi giải đố.

source: Show the timer
fr: Affiche le chronomètre
vi: Hiển thị đồng hồ bấm giờ

source: Show the timer during solving the puzzle.
fr: Afficher le chronomètre pendant la résolution du puzzle.
vi: Hiển thị đồng hồ khi đang giải đố.

source: Highlight mistakes
fr: Signale les erreurs
vi: Tô sáng ô sai

source: Highlight cells with wrong values.
fr: Signaler les cases qui n’ont pas la bonne valeur.
vi: Tô sáng các ô có giá trị sai.

source: Highlight duplicated cells
fr: Signale les doublons
vi: Tô sáng ô trùng số

source: Highlight cells that have the same value.
fr: Signaler les cases qui ont la même valeur.
vi: Tô sáng các ô có cùng giá trị.

source: Draw a line over the path
fr: Dessine une ligne au dessus du chemin
vi: Vẽ đường đi trên lưới

source: Display the number picker on second click
fr: Affiche le menu de sélection des chiffres après un second click
vi: Hiển thị bảng chọn số khi nhấn lần hai

source: When true, the first click selects the cell and the second click shows the number picker popup.
fr: Si vrai, le premier click sélectionne la case et le second click affiche le menu de sélection des chiffres.
vi: Khi bật, nhấn lần đầu chọn ô, nhấn lần hai sẽ hiện bảng chọn số.

source: Use the default color for cell values
fr: Utilise la couleur par défaut pour les chiffres
vi: Dùng màu mặc định cho số trong ô

source: Whether to use the puzzle default color for the cell numbers.
fr: Utiliser ou non la couleur par défaut pour les chiffres dans les cases.
vi: Có dùng màu mặc định của câu đố cho các số trong ô hay không.

source: Color of the cell values
fr: Couleur des chiffres
vi: Màu số trong ô

source: Color (red, green, blue, alpha) of the cell numbers.
fr: Couleur (rouge, vert, bleu, transparence) des chiffres dans les cases.
vi: Màu (đỏ, xanh lá, xanh dương, trong suốt) của số trong ô.

source: Use the default color for cell with wrong values
fr: Utilise la couleur par défaut pour les chiffres erronés
vi: Dùng màu mặc định cho ô sai

source: Whether to use the puzzle default color for the numbers in duplicated or cells in error.
fr: Utiliser ou non la couleur par défaut pour les chiffres erronés ou en double dans les cases.
vi: Có dùng màu mặc định của câu đố cho số trong các ô trùng hoặc sai hay không.

source: Color of the cell values for cells in error
fr: Couleur des chiffres pour les cases en erreur
vi: Màu số trong ô sai

source: Color (red, green, blue, alpha) of the cell numbers for duplicated or cells in error.
fr: Couleur (rouge, vert, bleu, transparence) des chiffres erronés ou en double dans les cases.
vi: Màu (đỏ, xanh lá, xanh dương, trong suốt) của số trong ô trùng hoặc sai.

source: Use the default color for cell background
fr: Utilise la couleur de fond par défaut pour les cases
vi: Dùng màu nền mặc định cho ô

source: Whether to use the puzzle default color for cell background.
fr: Utiliser ou non la couleur par défaut pour la couleur de fond des cases.
vi: Có dùng màu nền mặc định của câu đố cho ô hay không.

source: Color of the cell background
fr: Couleur de fond des cases
vi: Màu nền ô

source: Color (red, green, blue, alpha) of the cell background.
fr: Couleur (rouge, vert, bleu, transparence) de fond des cases.
vi: Màu (đỏ, xanh lá, xanh dương, trong suốt) của nền ô.

source: Use the default color for the background of hint cells
fr: Utilise la couleur de fond par défaut pour les nombre déjà placés
vi: Dùng màu mặc định cho nền ô gợi ý

source: Whether to use the puzzle default background color for cells that provide hints.
fr: Utiliser ou non la couleur par défaut pour la couleur de fond des cases qui fournissent un indice.
vi: Có dùng màu nền mặc định của câu đố cho các ô gợi ý hay không.

source: Background color of the hint cells
fr: Couleur de fond des indices
vi: Màu nền ô gợi ý

source: Background color (red, green, blue, alpha) for the cells that provide hints.
fr: Couleur (rouge, vert, bleu, transparence) de fond des cases qui fournissent les indices.
vi: Màu nền (đỏ, xanh lá, xanh dương, trong suốt) cho các ô gợi ý.

source: Use the default color for the selected cell background
fr: Utilise la couleur de fond par défaut pour la case sélectionnée
vi: Dùng màu mặc định cho nền ô đang chọn

source: Whether to use the puzzle default color for the background of the selected cell.
fr: Utiliser ou non la couleur par défaut pour la couleur de fond de la case sélectionnée.
vi: Có dùng màu mặc định của câu đố cho nền ô đang chọn hay không.

source: Background color of the selected cell
fr: Couleur de fond de la case sélectionnée
vi: Màu nền ô đang chọn

source: Color (red, green, blue, alpha) of the selected cell background.
fr: Couleur (rouge, vert, bleu, transparence) de fond de la case sélectionnée.
vi: Màu (đỏ, xanh lá, xanh dương, trong suốt) của nền ô đang chọn.

source: Use the default color for cell borders
fr: Utilise la couleur par défaut pour la bordure des cases
vi: Dùng màu mặc định cho viền ô

source: Whether to use the puzzle default color for the cell borders and diamonds.
fr: Utiliser ou non la couleur par défaut pour la bordure des cases et les losanges.
vi: Có dùng màu mặc định của câu đố cho viền ô và kim cương hay không.

source: Color of the cell borders
fr: Couleur de la bordure des cases
vi: Màu viền ô

source: Color (red, green, blue, alpha) of the cell borders and diamonds.
fr: Couleur (rouge, vert, bleu, transparence) de la bordure des cases et des losanges.
vi: Màu (đỏ, xanh lục, xanh lam, alpha) của các đường viền ô và hình kim cương.

source: Use the default color for path
fr: Utilise la couleur par défaut pour le chemin
vi: Dùng màu mặc định cho đường dẫn

source: Whether to use the puzzle default color for the path over the cells.
fr: Utiliser ou non la couleur par défaut pour le chemin dessiné au dessus des cases.
vi: Có dùng màu mặc định của câu đố cho đường dẫn trên các ô hay không.

source: Color of the path
fr: Couleur du chemin
vi: Màu của đường dẫn

source: Color (red, green, blue, alpha) of the path over the cells.
fr: Couleur (rouge, vert, bleu, transparence) du chemin dessiné au dessus des cases.
vi: Màu (đỏ, xanh lục, xanh lam, alpha) của đường dẫn trên các ô.

source: Show the puzzle background
fr: Affiche le fond derrière le puzzle
vi: Hiện nền câu đố

source: Whether to display the colored background behind the puzzle.
fr: Afficher ou non le fond coloré derrière le puzzle.
vi: Có hiển thị nền màu phía sau câu đố hay không.

source: Use thick borders for the selected cell
fr: Utilise une bordure épaisse pour la case sélectionnée
vi: Dùng đường viền dày cho ô được chọn

source: Whether to draw a thick border to make the selected cell more visible.
fr: Dessiner ou non une bordure épaisse autour de la case sélectionnée pour le rendre plus visible.
vi: Có vẽ đường viền dày để ô được chọn dễ nhìn hơn hay không.

source: Close
fr: Fermer
vi: Đóng

source: Play _Again
fr: _Rejouer
vi: Chơi _lại

source: High Scores
fr: Tableau des scores
vi: Điểm cao

source: Undo Action
fr: Annule la dernière action
vi: Hoàn tác hành động

source: Redo Action
fr: Rétablit la dernière action
vi: Làm lại hành động

source: Pause
vi: Tạm dừng

source: Play
fr: Jouer
vi: Chơi

source: Mistake counter
fr: Compteur d’erreurs
vi: Bộ đếm lỗi

source: Timer
fr: Chronomètre
vi: Bộ hẹn giờ

source: Paused
fr: En pause
vi: Đã tạm dừng

source: Continue the game
fr: Poursuivre le jeu
vi: Tiếp tục trò chơi

source: Resume
fr: Continuer
vi: Tiếp tục

source: _New Game…
fr: _Nouvelle partie…
vi: Trò _chơi mới…

source: New _Game (Same Puzzle)
fr: Nouvelle _partie (même puzzle)
vi: Trò chơi _mới (Cùng câu đố)

source: _Reset Puzzle
fr: _Réinitialiser le puzzle
vi: Đặ_t lại câu đố

source: _Scores
vi: Điể_m

source: Prin_t
fr: _Imprimer
vi: _In

source: Print _Current Puzzle…
fr: Imprimer le jeu en _cours…
vi: In câu đố _hiện tại…

source: Print _Multiple Puzzles…
fr: Imprimer plusieurs _jeux…
vi: In _nhiều câu đố…

source: Zoom
vi: Phóng to/thu nhỏ

source: Set Checkp_oint
fr: Définir un p_oint d’étape
vi: Đặt điểm _kiểm tra

source: _Undo to Last Checkpoint...
vi: Hoàn _tác về điểm kiểm tra cuối...

source: Solve Current Ce_ll
fr: Résoudre _la case sélectionnée
vi: Giải ô _hiện tại

source: Solve Pu_zzle
fr: Rés_oudre le puzzle
vi: Giải _câu đố

source: _Preferences
fr: _Préférences
vi: _Tùy chọn

source: _Keyboard Shortcuts
fr: R_accourcis clavier
vi: Phím _tắt bàn phím

source: _Help
fr: Aid_e
vi: _Trợ giúp

source: _About Hexkudo
fr: À propos de _Hexkudo
vi: _Về Hexkudo

source: Main Menu
fr: Menu principal
vi: Menu chính

source: Zoom Out
fr: Dézoomer
vi: Thu nhỏ

source: Zoom In
fr: Zoomer
vi: Phóng to

source: Fullscreen
fr: Plein écran
vi: Toàn màn hình

source: Leave Fullscreen
fr: Quitter le plein écran
vi: Thoát toàn màn hình

source: General
fr: Général
vi: Chung

# General Preferences
source: Controls
fr: Contrôles
vi: Điều khiển

# General Preferences
source: _Timer and Highscores
fr: Chronomètre et _tableau des scores
vi: _Bộ hẹn giờ và Điểm cao

source: Show the timer during solving the puzzle
fr: Affiche le chronomètre
vi: Hiện bộ hẹn giờ trong khi giải câu đố

# General Preferences
source: Show Mistake _Counter
fr: Affiche le _compteur d’erreurs
vi: Hiện bộ đếm _lỗi

source: Show the number of incorrect inputs made during solving the puzzle
fr: Indique le nombre d’erreurs pendant la résolution du jeu
vi: Hiện số lần nhập sai được thực hiện trong khi giải câu đố

# General Preferences
source: Draw the _Path
fr: Dessine le c_hemin
vi: Vẽ đường _dẫn

source: Help you follow the path by drawing a line over the cells
fr: Vous aide à suivre le chemin en dessinant une ligne au dessus des cases
vi: Giúp bạn theo dõi đường dẫn bằng cách vẽ một đường trên các ô

# General Preferences
source: Number Picker on _Second Click
fr: Sélection des nombres avec le _second click
vi: Bộ chọn _số khi Nhấp chuột lần thứ hai

source: First click selects the cell, second click displays the number picker
fr: Un premier click sélectionne la case, un second click affiche le menu de sélection des nombres
vi: Nhấp chuột lần đầu chọn ô, nhấp chuột lần thứ hai hiển thị bộ chọn số

# General Preferences
source: Warnings
fr: Alertes
vi: Cảnh báo

# General Preferences
source: Highlight _Wrong Values
fr: Surligne les _valeurs erronées
vi: Tô sáng giá trị _sai

source: Color the cells not matching the final solution
fr: Colore les cases qui ne correspondent pas à la solution
vi: Tô màu các ô không khớp với lời giải cuối cùng

# General Preferences
source: Highlight _Duplicate Cells
fr: Surligne les _doublons
vi: Tô sáng ô _trùng lặp

source: Color the cells that have the same value
fr: Colore les cases qui comportent des doublons
vi: Tô màu các ô có cùng giá trị

# General Preferences
source: Danger Zone
fr: Attention Danger
vi: Vùng nguy hiểm

# General Preferences
source: _Reset High Score Boards...
fr: _Réinitialise le tableau des scores
vi: Đặ_t lại bảng điểm cao...

source: Appearance
fr: Apparence
vi: Giao diện

# Appearance Preferences
source: Colors
fr: Couleurs
vi: Màu sắc

# Appearance Preferences
source: Use Default Color for Cell _Values
fr: Utiliser la couleur par défaut pour les _valeurs des cases
vi: Dùng Màu mặc định cho _Giá trị ô

source: Color of the numbers in the cells
fr: Couleur des chiffres dans les cases
vi: Màu của các số trong ô

# Appearance Preferences
source: Custom Color
fr: Couleur personnalisée
vi: Màu tùy chỉnh

# Appearance Preferences
source: Use Default Color for Cells with _Wrong Values
fr: Utilis_er la couleur par défaut pour les cases aux valeurs incorrectes
vi: Dùng Màu mặc định cho các ô có giá trị _sai

source: Color of the numbers in cells with wrong or duplicated values
fr: Couleur des chiffres dans les cases avec des valeurs incorrectes ou dupliquées
vi: Màu của các số trong ô có giá trị sai hoặc trùng lặp

# Appearance Preferences
source: Use Default Color for Cell _Background
fr: Utiliser la couleur par défaut pour l’_arrière-plan des cases
vi: Dùng Màu mặc định cho _Nền ô

# Appearance Preferences
source: Use Default Background Color for _Hints
fr: Utiliser la couleur d’arrière-plan par défaut pour les _indices
vi: Dùng Màu nền mặc định cho _Gợi ý

source: Background color of the cells that provide hints
fr: Couleur d’arrière-plan des cases fournissant des indices
vi: Màu nền của các ô cung cấp gợi ý

# Appearance Preferences
source: Use Default Color for the _Selected Cell Background
fr: Utiliser la couleur par défaut pour l’arrière-plan de la case _sélectionné
vi: Dùng Màu mặc định cho Nền ô được _chọn

# Appearance Preferences
source: Use Default Color for Cell B_orders
fr: Utiliser la couleur par défaut pour les b_ordures des cases
vi: Dùng Màu mặc định cho Đường _viền ô

source: Color of the diamonds and the cell borders
fr: Couleur des losanges et des bordures des cases
vi: Màu của các hình kim cương và đường viền ô

# Appearance Preferences
source: Use Default Color for the _Path
fr: Utiliser la couleur par défaut pour le _chemin
vi: Dùng Màu mặc định cho Đường _dẫn

source: Color of the path line over the cells
fr: Couleur du chemin au-dessus des cases
vi: Màu của đường dẫn trên các ô

# General Preferences
source: Appearance
fr: Apparence
vi: Giao diện

# Appearance Preferences
source: Show the Puzzle B_ackground
fr: Afficher l’arrière-plan du p_uzzle
vi: Hiện _nền câu đố

source: Show the colored background behind the puzzle
fr: Afficher l’arrière-plan coloré derrière le puzzle
vi: Hiện nền màu phía sau câu đố

# General Preferences
source: Use _Thick Borders for the Selected Cell
fr: Utiliser des _bordures épaisses pour la case sélectionné
vi: Dùng đường viền _dày cho ô được chọn

source: Make the selected cell more visible by using a thick border
fr: Rendre la case sélectionné plus visible en utilisant une bordure épaisse
vi: Làm cho ô được chọn dễ nhìn hơn bằng cách dùng đường viền dày

source: Print Multiple Puzzles
fr: Imprimer plusieurs puzzles
vi: In nhiều câu đố

source: Number of puzzles
fr: Nombre de puzzles
vi: Số lượng câu đố

source: Number of puzzles per page
fr: Nombre de puzzles par page
vi: Số lượng câu đố trên mỗi trang

source: Include solution
fr: Inclure la solution
vi: Bao gồm lời giải

source: Puzzle
vi: Câu đố

source: _Print
fr: Im_primer
vi: _In

source: Preparing Puzzles for Printing
fr: Préparation des puzzles pour l’impression
vi: Đang chuẩn bị câu đố để in

source: Play some games and your scores will show up here.
fr: Jouez quelques parties et vos scores apparaîtront ici.
vi: Chơi vài ván và điểm số của bạn sẽ hiện ở đây.

source: Pos
vi: Hạng

source: Time
fr: Temps
vi: Thời gian

source: Errors
fr: Erreurs
vi: Lỗi

source: Date/Time
fr: Date/Heure
vi: Ngày/Giờ

source: Select Puzzle
fr: Sélectionner un puzzle
vi: Chọn câu đố

source: Back
fr: Retour
vi: Quay lại

source: _Start Game
fr: _Démarrer la partie
vi: _Bắt đầu trò chơi

# Shortcuts Window
source: Game
fr: Partie
vi: Trò chơi

# Shortcuts Window
source: Move
fr: Déplacer
vi: Di chuyển

# Shortcuts Window
source: Clear Cell
fr: Effacer la valeur de la case
vi: Xóa ô

# Shortcuts Window
source: Number Picker
fr: Sélecteur de nombres
vi: Bộ chọn số

# Shortcuts Window
source: Undo
fr: Annuler
vi: Hoàn tác

# Shortcuts Window
source: Redo
fr: Rétablir
vi: Làm lại

# Shortcuts Window
source: Pause/Resume
fr: Pause/Reprendre
vi: Tạm dừng/Tiếp tục

# Shortcuts Window
source: Set Checkpoint
fr: Définir un point d’étape
vi: Đặt điểm kiểm tra

# Shortcuts Window
source: Solve Selected Cell
fr: Résoudre la case sélectionné
vi: Giải ô được chọn

# Shortcuts Window
source: Show/Hide Errors
fr: Afficher/Masquer les erreurs
vi: Hiện/Ẩn lỗi

# Shortcuts Window
source: Show/Hide Duplicated Cells
fr: Afficher/Masquer les cases en double
vi: Hiện/Ẩn ô trùng lặp

# Shortcuts Window
source: New Game
fr: Nouvelle partie
vi: Trò chơi mới

# Shortcuts Window
source: Reset Puzzle
fr: Réinitialiser le puzzle
vi: Đặt lại câu đố

# Shortcuts Window
source: Window
fr: Fenêtre
vi: Cửa sổ

# Shortcuts Window
source: Go Back
fr: Retourner
vi: Quay lại

# Shortcuts Window
source: Zoom In
fr: Agrandir
vi: Phóng to

# Shortcuts Window
source: Zoom Out
fr: Rétrécir
vi: Thu nhỏ

# Shortcuts Window
source: Print Current Puzzle
fr: Imprimer le puzzle en cours
vi: In câu đố hiện tại

# Shortcuts Window
source: Preferences
fr: Préférences
vi: Tùy chọn

# Shortcuts Window
source: Keyboard Shortcuts
fr: Raccourcis clavier
vi: Phím tắt bàn phím

# Shortcuts Window
source: Quit
fr: Quitter
vi: Thoát

# Shortcuts Window
source: Help
fr: Aide
vi: Trợ giúp

# Shortcuts Window
source: Fullscreen
fr: Plein écran
vi: Toàn màn hình

source: Select Difficulty
fr: Sélectionner la difficulté
vi: Chọn độ khó

source: Select Puzzle Difficulty
fr: Sélectionner la difficulté du puzzle
vi: Chọn độ khó câu đố

# Difficulty
source: _Easy
fr: _Facile
vi: _Dễ

# Difficulty
source: _Medium
fr: _Moyen
vi: _Trung bình

# Difficulty
source: _Hard
fr: _Difficile
vi: _Khó

source: _Select Puzzle
fr: _Sélectionner le puzzle
vi: _Chọn câu đố

source: Classic
fr: Classique
vi: Cổ điển

source: Heart
fr: Cœur
vi: Trái tim

source: Square
fr: Carré
vi: Vuông

source: Easy
fr: Facile
vi: Dễ

source: Medium
fr: Moyen
vi: Trung bình

source: Hard
fr: Difficile
vi: Khó

source: Random
fr: Aléatoire
vi: Ngẫu nhiên

source: The puzzle is solved!
fr: Le puzzle est résolu !
vi: Câu đố đã được giải!

source: Well done, you completed the puzzle!
fr: Bravo, vous avez résolu le puzzle !
vi: Làm tốt lắm, bạn đã hoàn thành câu đố!

source: Clear
fr: Effacer
vi: Xóa

source: Error Printing Puzzles
fr: Erreur lors de l’impression des puzzles
vi: Lỗi in câu đố

source: solution
vi: lời giải

source: Checkpoint set
fr: Point d’étape défini
vi: Đã đặt điểm kiểm tra

source: Undo to Last Checkpoint?
fr: Annuler jusqu’au dernier point d’étape ?
vi: Hoàn tác về điểm kiểm tra cuối?

source: Are you sure that you want to undo all actions since the last checkpoint?
fr: Êtes-vous sûr de vouloir annuler toutes les actions depuis le dernier point d’étape ?
vi: Bạn có chắc chắn muốn hoàn tác tất cả các hành động kể từ điểm kiểm tra cuối cùng không?

source: Cancel
fr: Annuler
vi: Hủy

source: Undo
fr: Annuler
vi: Hoàn tác

source: {puzzle_name} {difficulty} Difficulty
fr: {puzzle_name} — difficulté {difficulty}
vi: {puzzle_name} Độ khó {difficulty}

source: Reset the High Score Boards?
fr: Réinitialiser les tableaux des meilleurs scores ?
vi: Đặt lại bảng điểm cao?

source: Are you sure that you want to delete all the high scores?
fr: Êtes-vous sûr de vouloir supprimer tous les meilleurs scores ?
vi: Bạn có chắc chắn muốn xóa tất cả điểm cao không?

source: Reset
fr: Réinitialiser
vi: Đặt lại

source: translator-credits
fr: credits-traducteur
vi: Vietnam Linux L10n <https://github.com/linux-l10n-vi> Loc Huynh <https://github.com/hthienloc>

source: Inspiration
vi: Cảm hứng
